{"_id":"49669b47-6ce0-42ff-bb8c-8f865602b049","_type":"location","sw_id":"PG000984_2_1_0","address_id":"f317e304-59a8-4ae8-bf3e-60b04f439082","organization_id":"3e1d15dd-8fb1-4796-8f53-9dfb5de3317f","short_desc":"Provides help and support through a weekday program of activities and socialization for adults experiencing chronic health care problems, including Alzheimer's Disease, so that they may remain in their homes","description":"BAY AREA COMMUNITY SERVICES (BACS) ADULT DAY CARE SERVICES provides help and support for adults experiencing chronic health care problems, including Alzheimer's Disease, so that they may remain in their homes. The program also provides respite for family members and caregivers who are assured that their loved ones are receiving reliable care while they attend to their daily affairs.DAY CARE PROGRAM provides a structured program of activities including memory exercises, reminiscing, cooking, mild body movement, games such as chair volleyball, arts and crafts, gardening, music and singing, drama, group discussions, field trips, and speakers sharing information about resources and entitlements. Activities are led by trained staff, both paid and volunteer. Door-to-door transportation is available for all clients who need it. A hot nutritionally-balanced meal, ongoing respite and support for caregivers and family members. Client referrals to other community agencies as needed are also available. The Day Care Program is open Monday-Friday, 9-3 (extended hours available), with a maximum of 30 clients in attendance each day. The flat monthly fee is based on $45 daily rate.The program serves people in the East Bay area, who are experiencing chronic health problems, including Alzheimer's Disease. Transportation is available for people residing in Oakland, Alameda and Piedmont. Also accessible by paratransit from outlying areas.Persons interested in volunteering at the Adult Day Care Program are encouraged to call and visit. Orientation and ongoing training is provided for all volunteers."}