{"_id":"40eeab1a-8ac6-448a-bb56-392de19ca469","_type":"location","sw_id":"PG000044_2_1_0","address_id":"554d8248-8739-401e-9977-f118561ad2a1","organization_id":"ff3f3122-ff0d-449c-9971-4b1e6d05010a","short_desc":"Administers and provides funding for One-Stop Career Centers, youth workforce programs, and provides business services to employers to meet hiring needs. ACWIB is responsible for workforce programs and resource development for Alameda County residents (excluding the City of Oakland)","description":"Provides job seekers with access to tools, resources and services that assist them with obtaining employment, and assists with their hiring needs via business goals via One-Stop Career Center system.Offers RAPID RESPONSE services to Employers and Dislocated Workers when companies undergo downsizing, relocation, layoffs and closures. Provides information on: career planning, retraining, and re-employment; how to access One-Stop Career Center services, personal and family counseling, as well as information from Employment Development Department on accessing unemployment insurance.ONE-STOP Career Centers offer the following (see separate East Bay WORKS/One Stop Career Center record for further details) or visit www.eastbayworks.org: self-directed job search resources, career counseling, assessment of skills and aptitudes, job search techniques, California State EDD services, resume writing, interviewing skills, training and other referrals, job placement and self-employment information. Provides information on the State of California's Eligible Training Provider List. To find the nearest One-Stop Career Center in Alameda County, visit www.ACWIB.org. Other employment resources are also available online at www.eastbayworks.com.YOUTH: EMPLOYMENT PLUS PROGRAM offers services to In-School and Out-of-School Youth and to current and/or Emancipated Foster Youth. Programs integrate academic, vocational, work-based and classroom-based instruction. Provides youth ages 16-21 with work readiness and job search assistance, paid and non-paid work experience/internship opportunities, counseling and mentoring, career development concepts, and follow-up services. Youth employment services are delivered through: Berkeley Youth Alternatives (BYA), 510-845-9010; Hayward Adult School, 510-293-8595; East Bay Youth and Family Initiatives, 925-273-4724; and Chabot College, 510-723-7502.BUSINESS SERVICES: Employers can access a wide array of services to meet their workforce needs. Services include customized training, on-the-job training opportunities, co-sponsor of employer events, recruitment activities and other forms of assistance."}