{"_id":"91ac4c4e-cb1c-41ed-83e3-94cf5364ded3","_type":"location","sw_id":"PG003063_2_1_0","address_id":"652a20c0-1874-4860-bcf7-61a84146f979","organization_id":"50f2972a-6427-4c40-b269-082810008088","short_desc":"CARD provides emergency preparedness and disaster response training and tools for nonprofits, businesses, and faith-based organizations","description":"CARD specializes in addressing the emergency services needs of nonprofit and faith agencies in Alameda County, Contra Costa County and other communities by request. CARD works to make all aspects of preparedness, response and recovery easy, low-cost, empowering and culturally appropriate. Seniors, children, people with disabilities, homeless and low-income residents, Limited English Proficiency (LEP) communities and others whose access and functional needs cannot be fully addressed by traditional disaster response entities will rely on their trained and  trusted community agencies for preparedness, response and recovery information and support.CARD has created a curriculum designed to enhance and leverage the assets, resources and missions of local service providers. Highlights of CARD's approach include: Interactive training, custom-tailored tools, adherence to a strict \"Use No Fear\" policy, emphasis on immediate benefits, and helping agencies to use preparedness trainings to build leadership, brand recognition and funding support. Modified, advanced or specialized versions of classes are available upon request. CARD provides consultations, trainings and support to government entities, funders, foundations and other community stakeholders wishing to address the preparedness needs of nonprofits and the vulnerable clients they serve. Several of CARD's community preparedness tools can found at www.CARDcanhelp.orgAgencies are encouraged to post preparedness questions on CARD’s blog: blog.CARDcanhelp.org, and to follow CARD on Twitter; www.Twitter.com/CARDcanhelp. CARD will use these tools before, during and after a disaster to provide information specific to nonprofits and vulnerable audiences. Agencies can also post questions and find information on www.Facebook.com/CARDcanhelp."}