{"_id":"92b30476-7331-4e7b-8ace-8c3b5d7988ef","_type":"location","sw_id":"PG000899_2_1_0","name":"Youth and Family Services Counseling Programs (YFS)","address_id":"39a94421-1052-42e1-acb3-9d55faeab36e","organization_id":"0c2ac804-f4c2-4b81-a3d2-15eac41bc815","short_desc":"Provides counseling and other related services for children 0-18 and their families","description":"Offers several different programs for parents, children, and teens that will help strengthen family relationships. Fees are covered by grants, Medi-Cal, other insurance or based on income and family size.Youth Service Center - Fremont and Newark: Crisis intervention, counseling and other assistance for families concerns about a child's delinquent or pre-delinquent behaviors (running away, fighting, gangs, drug abuse, probation).Truancy Intervention Program(TIP) - Fremont and Newark: Designed to reduce truancy and increase school success through assessment, individual and family counseling, crisis intervention, and assistance securing services for other barriers to school success. Infant Toddler Program - Fremont, Newark, or Union City: Parent/child counseling provided at home or office for parents concerned about their baby/toddler's development, eating. sleeping. hitting, tantrums, nonstop crying or the impact of family difficulties (domestic violence, divorce, death).Juvenile Diversion - Fremont Police Department: Youth arrested for the first time avoid a juvenile court record through participation in a family assessment, follow-up individual and family counseling, and restitution of damages. Trauma Support - Fremont Police Department: Supportive counseling and assistance for a variety of police officer involved situations (auto accident, family violence).Healthy Choices School-Site Counseling: Individual and group counseling at 20 plus school sites in Fremont and Newark for students needing support with school adjustment, family and personal problems. Services include teacher consultations and crisis intervention.Parent Education and Support: One-time workshops and multi-week classes including Parent Project for parents of difficult, beyond control youth and teens; Parenting 101 for parents of younger children; Kids Turn (cosponsored by YFC) for families adjusting to parents' separation or divorce. YFS staff link families to the more than 20 programs co-located at the Family Resource Center and Community Alliance for Special Education(CASE) which provides information and advocacy for parents of children with special needs."}