{"_id":"21a68cc1-6cd1-4321-a0da-ff3170576f84","_type":"location","sw_id":"PG004334_2_1_0","address_id":"e0cf64cf-cb7e-42e9-9c37-adc67b6e0038","organization_id":"cc34a12b-0e93-447e-a67f-730e22292d67","short_desc":"The Keep Your Home California programs are focused on assisting low and moderate income families stay in their homes, when possible, and leveraging additional contributions from mortgage servicers","description":"If you are close to losing your home or know someone who is, California has 4 NEW Housing Finance programs that can provide direct assistance to help prevent foreclosure.UNEMPLOYMENT MORTGAGE ASSISTANCE PROGRAM (UMA) – Intended to assist homeowners who have experienced involuntary job loss. Provides temporary financial assistance in the form of a mortgage payment subsidy of varying size and term to unemployed homeowners who wish to remain in their homes but are in imminent danger of foreclosure due to short-term financial problems. These funds can provide up to six months of benefits with a monthly payment of up to $3,000 or 100% of the existing total monthly mortgage, whichever is less.MORTGAGE REINSTATEMENT ASSISTANCE PROGRAM (MRAP) – Intended to assist homeowners who have fallen behind on their mortgage payments due to a temporary change in a household circumstance. MRAP will provide limited financial assistance in the form of funds to reinstate mortgage loans that are in arrears in order to prevent potential foreclosures. These funds can provide benefits of up to $15,000 per household.PRINCIPAL REDUCTION PROGRAM (PRP) – Intended to assist homeowners at risk of default because of an economic hardship coupled with a severe decline in the home’s value. PRP will provide capital to reduce outstanding principal balances of qualifying borrowers with negative equity. Principal balances will be reduced in an effort to prevent avoidable foreclosures and promote sustainable homeownership. The principal reduction program will most likely be a prelude to loan modification. (Servicers that contribute through matching funds increase the benefit for homeowners.)TRANSITION ASSISTANCE PROGRAM (TAP) – Intended to promote community stabilization by providing homeowners with relocation assistance when it is determined that they can no longer afford their home. TAP will be used in conjunction with a servicer-approved short sale or deed-in-lieu of foreclosure program in order to help homeowners transition into stable and affordable housing. Homeowners will be responsible to occupy and maintain the property until the home is sold or returned to the servicer as negotiated. Funds will be available on a one-time only basis.To find out if you or someone you know is eligible for one of these federally funded programs, please visit www.keepyourhomecalifornia.org."}