{"_id":"96f39c06-f6f5-40e1-8206-80ab0e7dac75","_type":"location","sw_id":"PG000285_2_1_0","address_id":"aea82460-b914-4c8e-9b1a-152de322cda1","organization_id":"f1e361c0-356f-490d-ae35-b548cdf47983","short_desc":"Provides library services to California residents including reference services, Internet access, and books, CDs, and DVDs  for checkout. A meeting room is available for public use","description":"Provides library services to adults and children, including reference services by phone. Online public catalog, ebooks, audiobooks and databases of the library can be accessed from home or office computers at www.library.hayward-ca.gov and used with a borrower's registration number. Materials and resources include books, newspapers, magazines, online databases, audio books, videocassettes, CDs and DVDs. Special collections include large-print materials and materials in Spanish, Vietnamese, Chinese, Hindi and Farsi. Books from dozens of other public and academic libraries statewide can be requested through the library’s website and delivered to Hayward for pick up free of charge in 2-5 business days. Free home delivery of books is available to homebound seniors.Printing from computers and copy machines is available for public use for a small fee. Free public access to the Internet, word processing, spreadsheet software and children’s software packages are available. Free public Wi-Fi access is available throughout the building.Confidential legal consultations are offered several times a month through Alameda County Bar Association's Lawyers in the Library program.STORYTIME programs are offered for children of all ages, including a bilingual English/Spanish story time.  Other children’s programs are offered regularly, including summer reading, games, craft projects and guest entertainers.TEENS are offered various programs throughout the year.  The Teen Area includes computers reserved for teen use.AFTERSCHOOL Homework Support Center is a free drop-in homework help for students in grades 4-12. Mondays & Tuesdays, 3:30-5:30; Wednesdays & Thursdays, 3-5."}