{"_id":"a5e58378-b7ae-4efd-a225-7666d1e69c30","_type":"location","sw_id":"PG003637_2_1_0","address_id":"6a78744d-33d5-40fc-a268-f4204b849ab9","organization_id":"4cd4d9c5-6388-4c6a-b040-7a441637c581","short_desc":"Provides information on dental services for eligible individuals under the Medi-Cal program","description":"Denti-Cal offers dental services as one of the benefits under the Medi-Cal program, primarily to children under age 21. See below for exceptions.Phone service (Interactive Voice Response System) offers the following options: help in locating a Denti-cal dentist in caller's area; clinical screening appointment information; questions regarding a Treatment Authorization Request; general Medi-Cal Dental program information, and how to file a grievance or complaint. Also offers information on covered benefits as well as how to file a Fair Hearing, request copies of dental records, or report suspected Medi-Cal fraud. NOTE: It is highly recommended that callers have their Beneficiary ID information (number) available when calling. Website advises that while phone hours are Monday-Friday, 8-5, the best time to call the Medi-Cal Dental Program is Monday-Friday, 8-10am.FURTHER ELIGIBILITY INFORMATION: Dental services for the following people are still eligible for benefits under the Denti-Cal program:a. Women 21 years of age or older who are pregnant will be eligible to receive pregnancy-related services or services to treat a condition that may cause a problem in pregnancy. These are services such as exams, cleanings and gum treatments, as well as emergency dental services for the relief of pain, infection or trauma.b. Beneficiaries age 21 and older who live in licensed Skilled Nursing Facilities (SNFs), licensed Intermediate Care Facilities (ICFs), ICF-Developmentally Disabled (DD), ICF-Developmentally Disabled Habilitative (DDH), or ICF-Developmentally Disabled Nursing (DDN) facilities.For more eligibility information, individuals are urged to contact their local Alameda County Social Services Agency office (see separate Agency record).Website also provides list of dentists, by county, who may be accepting new Denti-Cal patients. Website also provides responses to Frequently Asked Questions regarding Denti-Cal and provides updated bulletins on the program."}