{"_id":"7023c28b-1874-434d-b186-82ab25e9e6f4","_type":"location","sw_id":"PG000076_2_1_0","name":"Behavioral Health Center - Partial Hospitalization / Intensive Outpatient Services (Adolescent, Adult, Geriatric and Medical Psychiatry)","address_id":"0c87c2fc-8778-4e43-9dd9-a6cb63046841","organization_id":"429f043e-9989-4970-9281-10925d946e49","short_desc":"Acute psychiatric outpatient program for adolescents, adults and eating disorder patients","description":"Each of the following programs is each available as a Partial Hospitalization Program (PHP) or Intensive Outpatient Program (IOP).Adult Day Hospital Program - Treats individuals with severe and/or persistent psychiatric conditions. Patients benefit from our integrative approach that uses patient-specific cognitive/behavioral and psychodynamic techniques. Adult Intensive Program - Provides treatment for patients dealing with work problems, environmental stresses, family/relationship difficulties, and grief and loss. Adult Outpatient Program - Is lower in intensity, so patients attend fewer hours per week. Patients 18 years and older receive help adjusting to and coping with life events, loss (i.e. death or physical incapacitation), or with disabling emotional disorders. Adolescent Programs - A Structured day program treats adolescents with psychiatric illness as well as those dealing with alcohol/substance abuse and eating disorders. Patients participate in therapeutic group activities to address emotional problems and family issues. Adolescent Eating Disorder Program(s) - Adolescents and adults with eating disorders are often subject to depression, anxiety, and low self-esteem. As an addition to either the partial hospitalization or intensive outpatient program, this track provides a separate, intensive focus on eating disorder issues. Dual Diagnosis Track - Patients suffering from two disorders such as substance abuse or dependency problem and a co-existing psychiatric disorder need the expertise of mental health and chemical dependency health care professionals."}