{"_id":"0e8006a4-9e04-460a-8bab-df0636276b3f","_type":"location","sw_id":"PG004622_2_1_0","address_id":"b4b234f6-d1f2-49c0-ae17-471738c621ab","organization_id":"7edb7f6c-f745-443a-9fa8-92e1b647ce29","short_desc":"Provides information on Norovirus, also known as stomach flu. Symptoms include nausea, vomiting, diarrhea, abdominal cramps, low grade fever or none at all","description":"Norovirus causes a gastrointestinal illness. It often occurs in outbreak form and is sometimes referred to as “stomach flu” (although the terms “flu” or \"influenza\" should really be restricted to a respiratory infection). Outbreaks are linked to food handled by infected individuals, by person-to-person contact (especially in day care centers and nursing homes/custodial institutions), and from eating raw shellfish (especially oysters and clams grown in sewage-contaminated waters).HOW PEOPLE GET INFECTED WITH NOROVIRUS: People get a Norovirus infection: (1) directly from an ill individual who did not wash his hands adequately; (2) indirectly from food or water contaminated by the stool or vomit from an infected person; or (3) from airborne particles produced by those vomiting.SIGNS AND SYMPTOMS OF NOROVIRUS: Nausea, vomiting, diarrhea, abdominal cramps, low grade fever or no fever at all. Symptoms usually appear one to two days after exposure.TREATMENT AND RECOVERY: No specific treatment is available. Infected persons usually recover fully in 1-3 days, but illness may be severe in elderly persons who may require hospitalization. Persons who are severely dehydrated might need fluid and electrolyte therapy.PREVENTION OF NOROVIRUS: (1) Wash hands with soap and warm water after toilet visits and before preparing or eating food; (2)  people with symptoms of Norwalk-like illness should not prepare food or provide patient care; (3) cook all shellfish thoroughly before eating; (4) wash raw vegetables before eating.CARE PROVIDERS: Custodial institutions need to assure a high level of personal hygiene to avoid person-to-person spread. Caretakers need to increase frequency of hand washing, especially before and after patient care."}