{"_id":"844bdd37-ee50-41dc-be9a-f1b4c0f5cae1","_type":"location","sw_id":"PG004241_2_1_0","address_id":"2442bb36-5a79-420d-b3d5-a16d82beda4c","organization_id":"0a4b396a-9db9-4c23-9ec2-4b536ed8b277","short_desc":"Provides admissions and records, financial aid, ESL and other services for students and prospective students of Merritt College","description":"ADMISSIONS AND RECORDS: Students may enroll online, by phone or in person. Assists students who wish to drop and add classes, get information about prerequisites, or apply for transcripts. Located in Building R, Room R112.DISABLED STUDENT PROGRAMS AND SERVICES: Helps students with verified disability to take steps or evaluate entitlement to receive accommodations in the college setting. Accommodations must be reasonable and are provided to give disabled students a fair chance at success in school. Disabilities may be physical, sensory, cognitive, psychiatric, and health-related. Located in Room P300FINANCIAL AID: Assists with information and applications for federal and state financial assistance, fee waivers, grants, loans, scholarships and federal work study. Located in Building R, Room R113.FRUITVALE EDUCATION CENTER: Instructional program and bilingual student services. ESL assessment, ESL classes, ESL computer classes, bilingual counseling, and registration assistance. Located at 1900 Fruitvale Avenue, Suite 1C.GENERAL COUNSELING: provides academic, career, and personal counseling services to help students identify educational, career and personal goals and develop plans to achieve those goals. Also refers students to other on-campus services. Some counseling services available on a drop-in basis while others require a scheduled appointment, 510-434-2475.MAXIMUM ACHIEVEMENT PROJECT (MAP): Aims to increase graduation rates of African-American males and low-income students. Mentoring, tutoring and paid internships. Learning, leadership and employment opportunities. To apply, contact 510-434-2475.PUENTE PROJECT: Mission is to increase the number of educationally disadvantaged students who enroll in four-year colleges and universities, earn college degrees, and return to the community as mentors and leaders. Puente Project Counselor can be reached at 510-434-3943. Located in Building R, Room R105H."}