{"_id":"d608f75d-7250-418a-8fea-903ab8073d65","_type":"location","sw_id":"PG004445_2_1_0","address_id":"23082156-edaf-410c-b02b-078182fa40c1","organization_id":"35e6ee36-0dfa-4e73-8c05-f089a33d0b28","short_desc":"Website provides the information regarding International Travel for U.S. Citizens, Passports for U.S. Citizens, Visas for Foreign Citizens, and Intercountry Adoption and Abduction information regarding both U.S. and Foreign Children and Families.INTERNAT.....more","description":"Website provides the information regarding International Travel for U.S. Citizens, Passports for U.S. Citizens, Visas for Foreign Citizens, and Intercountry Adoption and Abduction information regarding both U.S. and Foreign Children and Families.INTERNATIONAL TRAVEL: provides information on conditions abroad that may affect U.S. travelers' safety and security. Includes current country specific information, travel alerts, and travel warnings.OFFICE OF AMERICAN CITIZEN SERVICES AND CRISIS MANAGEMENT (ACS) works with overseas embassies and consulates to provide emergency services to Americans abroad. Can help to send money overseas to assist U.S. citizens, repatriate the remains of loved ones who have died, assist victims of crime, help U.S. citizens who are detained in foreign prisons, and administer a repatriation loan to bring home destitute Americans. Operates a 24-hour Duty Office Program.PASSPORTS: provides information on how to apply, how to renew, how to report and/or replace a lost or stolen passport in the U.S. (for overseas help, contact the nearest U.S. Embassy or Consulate), how to correct or change U.S. passport information, and updated information on new requirements.VISA is required for foreign citizens to travel to the U.S. Type of visa depends on purpose of travel. Visa Services, Public Inquiries Division provides a selection of pre-recorded information and the ability to talk to a visa specialist during business hours.OFFICE OF CHILDREN'S ISSUES provides assistance to parents who seek to adopt orphans from abroad (intercountry adoption), and handles international parental child abduction (the abduction of a child from one parent to another country by the other parent)."}