{"_id":"f0c4d05e-60ab-4aae-b032-eb18d2c87eb9","_type":"location","sw_id":"PG002228_2_1_0","address_id":"c8eba374-5a06-4218-a3d3-3a30570f6359","organization_id":"f1e361c0-356f-490d-ae35-b548cdf47983","short_desc":"Provides library services to adults and children, including reference services by phone and online catalog accessible to borrowers from home","description":"Provides library services to adults and children, including reference services by phone. Online public catalog, ebooks, downloadable audiobooks and databases of the library can be accessed at www.library.hayward-ca.gov and used with a borrower's registration number.Materials and resources include books, newspapers, magazines, online databases, audio books, videocassettes, CDs and DVDs.  Special collections include large-print materials and materials in Spanish, Vietnamese, Chinese, Hindi and Farsi. Books from other public and academic libraries statewide can be requested through the library’s website and delivered to Hayward for pick up free of charge in 2-5 business days. Free home delivery of books is available to homebound seniors.Printing from computers and copy machines is available for public use for a small fee. Free public access to the Internet, word processing, spreadsheet software and children’s software packages are available. Free public wi-fi access is available throughout the building.Other free services include ESL instruction and adult literacy tutoring (see below). Confidential legal consultations are offered several times a month through Alameda County Bar Association's Lawyers in the Library program.STORYTIME programs are offered for children of all ages, including a bilingual English/Spanish story time.  Other children’s programs are offered regularly, including summer reading, games, craft projects and guest entertainers.TEENS are offered various programs throughout the year.  The Teen Area includes computers reserved for teen use.AFTERSCHOOL HOMEWORK HELP CENTER for students in grades 4-12. Mondays & Tuesdays, 3:30-5:30; Wednesdays & Thursdays, 3-5.ADULT LITERACY SERVICES (LITERACY PLUS) offers the following FREE services: (1) Individual and confidential tutoring, matching volunteer tutors with English-speaking adults who want to improve their literacy skills; also provides small group classes and a computer-learning center; (2) A Families for Literacy program for children of adult learners."}