{"_id":"91a6fc33-fd45-4fbc-99f5-61cc6de5fdd0","_type":"location","sw_id":"PG002940_2_1_0","address_id":"d4f142eb-856f-471d-8872-9449197859ae","organization_id":"5b139d7b-ae76-4a8d-a11d-046f8e92e426","short_desc":"Various self-help mutual support groups are available for over-eaters, smoking cessation, alcoholics anonymous, parents of special needs children, caregivers, people who are grieving, and individuals who have myasthenia gravis","description":"CANCER SUPPORT GROUP is held four times a year. For current group availability call 510-264-4068.OVEREATERS ANONYMOUS, a 12-step study group Tuesday evenings from 6:30pm-7:30pm; HOW (Honest, Open, and Willing) is an Over-Eaters Anonymous group program approach to a healthier life-style. The group meets once a week on Wednesdays from 7pm-8pm. Call St. Rose Community Education at 510-264-4044 for more information.CAREGIVER SUPPORT GROUPS offers a monthly forum for providing socialization, resources, guest speakers, and mutual support in a caring atmosphere. Classes are held on the first Saturday of each month, from 10-12pm. Call 510-264-4050 for more information.MYASTHENIA GRAVIS offers moral support, coping skills, and helpful advice in person at the group meetings, or simply by phone. Call 510-792-6141 for further information. Meets quarterly on Sunday from 1pm-3pm.ALCOHOLIC ANONYMOUS is a fellowship of men and women who share their experience, strength, and hope with each other to solve their common problem and help others to recover from alcoholism. SOS (a help/intervention group) meets each Friday from 7:30pm-9pm in the Boardroom. Pot-O-Gold (a words of wisdom group) meets each Saturday from 7:30pm-9pm in the Boardroom. Call 510-839-8900 for further information.GRIEF SUPPORT GROUP offers a series of eight sessions for people to meet and offer support for those who are grieving or who wish to support others as they begin to heal. Call 510-264-4050 for session dates.THE CO-DEPENDENT ANONYMOUS SUPPORT AND STUDY GROUP MEETS every Friday from 7pm-8:30pm.MOMMY & ME SUPPORT Call St. Rose Community Education at 510-264-4044 for more information.St. Rose Hospital offers a wide variety of Free Parenting Classes such as Lamaze, Newborn Care, Sibling Prep Classes, and Breastfeeding. Pre-registration required. Call 510-264-4068 for more information on dates and times."}