{"_id":"49ef767a-5ba1-41e3-bf22-1270dc784f60","_type":"location","sw_id":"PG000047_2_1_0","name":"CalWORKs","address_id":"4167e6f3-9d01-4490-a13e-43f90c7f43bf","organization_id":"272afec5-b284-4cc1-82c5-cc93b8e48106","short_desc":"Provides financial assistance and social services for low-income children and their families. Education, job training and job services to TANF recipients","description":"TANF (Temporary Assistance to Needy Families) provides financial assistance for eligible low-income children (unborn through age 19) and parents/guardians. IMMEDIATE NEED TANF provides qualified applicants with a cash advance. CalWORKs standard applications are processed within 45 days.CalWORKs (California Work Opportunity and Responsibility to Kids) requires employable TANF recipients to participate in Welfare- to-Work activities to receive aid. CalWORKs families may qualify for CalFresh, Medi-Cal, child support enforcement, employment services, family planning, Child Health and Disability Prevention (CHDP), childcare and transportation. HOMELESS ASSISTANCE PROGRAM provides one time temporary shelter and permanent housing deposit assistance for homeless TANF and TANF-eligible families that have never received Homeless Assistance before. Also provides assistance of up to two months of back rent for families at risk of homelessness due to a receipt of a \"Pay, Rent or Quit\" notice, with exceptions.INTERACTIVE VOICE REPONSE SYSTEM (IVR) at 1-888-999-4772 or 510-263-2420 offers recorded information including how and where to apply for benefits. To speak directly with an Eligibility Support Clerk or Technician, press 0 (Zero Out feature).CalWORKs services are offered at North County, South County, Eastmont, Fremont and Livermore Offices. Applications can be dropped off at any Alameda County Social Service office. Interpretation services are available Monday-Friday, 8:30-5. Individuals may also apply and register to view information about their cases online at the CALWIN website: www.mybenefitscalwin.org."}