{"_id":"e44fbb2e-7000-466d-b04d-5ed963823ae7","_type":"location","sw_id":"PG004042_2_1_0","name":"LightHouse","address_id":"b95e90cc-b046-4550-9dea-c5494bceccf4","organization_id":"b7f0401c-a2a6-4950-84bc-7737b402b72d","short_desc":"Empowers people of all ages who are visually impaired or blind to lead safe, active and independent lives","description":"Founded in San Francisco in 1902, the LightHouse's mission is to promote the independence, equality and self-reliance of people who are blind or visually impaired.ADAPTATIONS: Lighthouse operates a brick-and-mortar store and online marketplace providing affordable low vision devises and assistive technology - such as canes, accessible technology and guide dog accessories.COMMUNITY SERVICE: Programs are designed to provide easy access to innovative, yet meaningful and relevant educational, recreational, social, wellness and advocacy opportunities for blind and low vision seniors, adults, and youth. Activities include yoga, blind backpacking, bingo, psychological services, LGBT meetings, and so much more.REHABILITATION SKILLS: LightHouse teaches blind or low-vision individuals the solutions to accomplish essential daily tasks with confidence. Skills taught include cane travel, magnification, organizational skills, low-vision cooking and use of access technology. \"Changing Vision, Changing Lives\" is our premier class offering supportive, fun, and immersive training for those new to vision loss.ACCESS TO INFORMATION SERVICES (AIS): They create braille and tactile maps, braille documents and business cards, and assist web developers to create web sites, forms, and online content that is accessible to the blind and low-vision community.EMPLOYMENT IMMERSION: LightHouse furnishes blind and low-vision jobseekers with the skills and career guidance they need to enter the workforce through an intensive program designed to prepare students for job searching, resume building, and interviewing.LIGHTHOUSE INDUSTRIES: Provides manufacturing employment opportunities for the blind and visually impaired.DEAF-BLIND PROGRAM: Provides canes, training in independent living, communication and access technology skills to increase independence and self-confidence. Video Phone: 510-356-0018.ENCHANTED HILLS CAMP (EHC): Since 1950, LightHouse has owned and operated EHC, which sprawls across 311 acres on Mt. Veeder in Napa, CA. At EHC, provides incomparable access to nature and exploration for blind and visually impaired kids, teens, adults and families."}