{"_id":"99f95b17-3433-4b05-8c5e-fe68c85ade07","_type":"location","sw_id":"PG000740_2_1_0","name":"Affordable Health Insurance for Pregnant Women","address_id":"7afebd06-84e6-4254-b2e2-5a7121405422","organization_id":"eff8c2dc-0e0e-4ae9-9763-51ec6820bfd6","short_desc":"Affordable health insurance program for pregnant, middle income women who are not eligible for no-cost Medi-Cal","description":"Provides low cost health insurance coverage to uninsured, middle income pregnant women. Total cost is 1.5% of the subscriber's adjusted annual  household income. The State of California and the Federal Government supplement the subscriber contribution to cover the full cost of care.ELIGIBILITY REQUIREMENTS: Pregnant 30 weeks or less as of application date; California resident; not a recipient of no-cost Medi-Cal or Medicare Part A and B as of application date; uninsured or covered by private insurance with a separate maternity deductible or co-payment of more than $500; and monthly household income within AIM guidelines.DOCUMENTS REQUIRED: Pregnancy certification; income verification documents and proof of income.APPLICATION DEADLINE INFORMATION: Complete application must be received by AIM Program prior to the end of 30th week of pregnancy in order to be considered for Program benefits. If near 30th week of pregnancy, applicant may send application overnight via Fed Ex, US Postal Service, or other means to: 625 Coolidge Drive, Suite 100, Folsom, CA 95630.Covers pregnant, middle income women until 60 days after delivery. Not a Medi-Cal program.In Alameda County, AIM Health Plans are available through ABC HMO, 1-800-327-0502, Monday-Friday, 7:30am-7pm. Plans could change within the year so call to confirm. Offers prenatal education program, screening and Perinatal Care Manager nurses. Includes multilingual customer service and also nurse advice line 24 hours daily.APPLICATIONS: PO Box 15559, Sacramento, CA 95852-0559.PAYMENTS: PO Box 15207, Sacramento, CA 95851-0207.OVERNIGHT APPLICATION ADDRESS: 625 Coolidge Drive, Suite 100, Folsom, CA 95630"}