{"_id":"2fd63e6f-211b-448d-8d01-33a3ef05e67c","_type":"location","sw_id":"PG002947_2_1_0","name":"East Bay Adult and Senior Care Regional Office","address_id":"7e0f85a7-8271-470c-abcb-1f2fe5a0671d","organization_id":"47d71e51-b2d3-45eb-852c-cc3ec50cd3aa","short_desc":"Licenses and monitors Adult Day and Residential Facilities to ensure they provide an adequate environment and sufficient quality of care for adult and elderly clients and residents","description":"Licenses and monitors Adult Day Programs and Residential Facilities serving adults and the elderly to ensure they provide an adequate environment and sufficient quality of care for clients and residents. ADULT DAY CARE/ADULT DAY PROGRAMS provide personal care for dependent adults and elderly in a supervised, protective setting during some portion of a 24-hour day. Services may include social and recreational activities, and training that is essential for sustaining the activities of daily living and meals, as appropriate.ADULT RESIDENTIAL FACILITIES (ARF) are of any capacity and provide 24-hour non-medical care for adults age 18-59, who are unable to provide for their own daily needs. Adults may be physically handicapped, developmentally disabled, and/or mentally disabled.Adult Residential Facilities for Persons with Special Needs (ARF PSHN) provide 24-hour services for up to five adults with developmental disabilities, who are being placed in the community following the closure of  Agnews Developmental Center, and who have special health care and intensive support needs.RESIDENTIAL CARE FACILITIES FOR THE CHRONICALLY ILL (RCFCI) are facilities that provide care and supervision to adults who are diagnosed with AIDS or have terminal illnesses/health conditions.SOCIAL REHABILITATION FACILITIES provide 24-hour non-medical care and supervision in a group setting to adults recovering from mental illnesses, who temporarily need assistance, guidance, or counseling.RESIDENTIAL CARE FACILITIES FOR THE ELDERLY (RCFE) are facilities that provide 24 hour residential care. They are often referred to as \"assisted living\"."}