{"_id":"c8f19b86-f8d0-42ad-8d47-0c724adde259","_type":"location","sw_id":"PG001790_2_1_0","name":"Child Assault Prevention (CAP) Training Center","address_id":"5c791919-cc62-46d7-9814-a96ed38cfbce","organization_id":"d0769962-a0d0-4954-8b37-b7586ff08941","short_desc":"Workshops for parents, teachers and children, preschool through high school, on child abuse prevention","description":"Provides psycho-educational workshops on child abuse and assault prevention and school-based therapeutic services.Child Assault Prevention (CAP) Program: Interactive, age-appropriate, non-threatening violence prevention curriculum for preschool, elementary, middle and high school students, including those with special needs. Actual topics vary by age group and include traditional bullying / Cyber bullying, child abduction, family violence, issues including sexual harassment and hate-motivated behavior. Also provides components for training parents / care givers and teachers.Youth Service Provider Workshops: Training topics include: dynamics of youth and family violence; definitions and characteristics of child abuse and neglect, or other forms of assault; mandated reporting and responsibilities; crisis intervention techniques; prevention strategies; community resources.Nurturing Parenting Programs (NPP): Workshops and groups designed to reduce the incidence of child abuse and neglect by teaching nurturing parenting skills. Serving families with children birth to 18 years and pregnant / parenting youth.CAP Mental health Services: School-based specialized therapeutic support services including individual/group/family therapy, case management, and consultation/ support to school staff serving targeted schools in Southern Alameda County.Community Workshops: Designed to meet the needs of the community (children, youth and adults) at non-traditional locations (i.e., faith communities, homeless shelters, etc.). Topics covered are based on interest and / or need.Regional Services: Provide certification training in the CAP model for new and existing CAP providers in California and surrounding states in conjunction with the International Center for Assault Prevention (ICAP).CHILD ASSAULT PREVENTION (CAP) PROGRAM: Provides age-appropriate, non-threatening psycho-educational workshops on Child Abuse and Assault Prevention, for children and youth (age 3-18) in schools, faith communities, and other youth-serving organizations. Focus areas are common assault situations like: bullying behavior, child abduction/Internet safety, sexual assault,family violence (physical abuse, verbal abuse, emotional abuse, and neglect ), domestic violence, sexual harassment, and hate-motivated behavior.MENTAL HEALTH SERVICES: School-based therapeutic support services for children coping with issues or problems that impede functioning at school, home and/or the community. Services to"}