{"_id":"e4aa812c-185c-4df7-bbd6-5fec6ca67eb2","_type":"location","sw_id":"PG002297_2_1_0","name":"Fremont Family Resource Center (FRC)","address_id":"876a4074-3c11-41ee-86c4-03d7257f6887","organization_id":"0c2ac804-f4c2-4b81-a3d2-15eac41bc815","short_desc":"Multiservice center operates in extensive collaboration and includes childcare, benefits assistance, financial counseling and information and referral services","description":"Operated in collaboration with 24 government and non-profit agencies. Services include adult and youth employment, childcare information and referral, counseling and mental health services, housing information, cash assistance, parent support services,  nutrition education programs, immigration services and some legal services. For a complete list of FRC agencies, go to www.fremont.gov and click on Family Resource Center.WELCOME CENTER: Provides information and referral, enrollment assistance in completing Medi-Cal and CalFresh or other applications.FAMILY SUPPORT SERVICES: A case management service that includes assessment, service planning, information and referral, linkage to community resources, advocacy and ongoing support.CAL-WORKSs FAMILY SERVICE TEAM: (Cal-WORKs participants) The FST combines the staff support of multiple organizations working with families to successfully achieve goals.DISCOVERY COVE DROP-IN CHILD CARE: Provides free childcare to FRC clients with infants to 12 years old, as well as affordable drop-in services to community parents with children ages 2 to 10 years old. The Center is open Monday-Friday, 8:30-5.YOUTH ON THE MOVE: A weekly support group for teens aged 13-17 challenged by gangs, drugs or alcohol and is co-sponsored by the Family Resource Center. The support group meet on Thursday evenings from 7:30-9pm (excluding holidays) at 39155 Liberty Street, Mediterranean Room, H810, Fremont. For more information or to register, please call Julian and Leticia Moreno (facilitators) directly at 510-472-2498 or Zionmoreno@yahoo.com.Cooling center open for everyone when temperatures are extreme. Open, Monday-Friday, 8-5."}