{"_id":"e0ec465c-30e3-41fd-95e0-752e6b879aa2","_type":"location","sw_id":"PG003192_2_1_0","address_id":"9cea77b0-71d3-4d3f-90c6-3c6637593544","organization_id":"a81d651d-8d2e-43fe-9647-046921754308","short_desc":"Serves all military veterans with a drop-in center, emergency shelter, mental health services, job training and employment referrals, legal help in obtaining veterans benefits, and a community for the formerly homeless called the Veterans Academy","description":"Swords to Plowshares is the only veterans service agency in the United States that provides a full continuum of care. Helps veterans, as well as families of veterans, in the following areas:HEALTH AND SOCIAL SERVICES provides veterans with the help they need to become self-sufficient by working closely with partner community organizations and the Department of Veterans Affairs. The Health and Social Services Department, known as the Frontline Drop-in Center, provides emergency shelter, mental health services and referrals to homeless veterans.SUPPORTIVE HOUSING offers permanent supportive housing at the Presidio in San Francisco combined with options for counseling, academic instruction and vocational training for 102 formerly homeless veterans with disabilities. Additionally, provide homeless veterans with enhanced transitional housing on Treasure Island and near San Francisco City College for 75 veterans at a time for intensive individual, group and peer counseling and a variety of recreational, cultural and community-building activities. Both housing programs provide daily hot meals to residents.EMPLOYMENT SUPPORT offers a comprehensive services that allow veterans to stabilize all aspects of their life and become job ready. Helps veterans from all walks of life realize their long-term career goals and make them a reality. Also helps veterans make the transition to gainful employment by offering vocational counseling, job training, resume preparation and job referrals.LEGAL SERVICES offers to many of our country's veterans that never apply for or receive the benefits they deserve. Swords to Plowshares is one of the few organizations in the country that provides free attorney representation, case management and advocacy to veterans seeking benefits.THE IRAQ VETERAN PROJECT launched in 2005 to make sure systems of care are appropriate, sufficient and accessible to meet the needs of veterans returning from the wars in Iraq and Afghanistan, and the needs of their families as well.These are the services that are offered at 1060 Howard Street, San Francisco, CA 94103:VETERANS living in the BAY AREA are homeless they should call 415-252-4788 and social workers or case managers can as for Stephen Kohlstrom at extension 342.VETERANS living in the BAY AREA need legal assistance with VA CLAIMS they can call 415-252-4788 and speak with Michael Wolchansky, Paralegal at extension 359.They have a team of 6 staff attorneys to serve any BAY AREA VETERAN with th"}