{"_id":"1b28265b-ecb3-42b1-b7c2-caf11da41fdc","_type":"location","sw_id":"PG002213_2_1_0","name":"Bay Area Chapter","address_id":"30d6fc99-7845-4162-ab97-7835dc5c400a","organization_id":"1a259e52-6136-4031-a68b-8a0d2b44028a","short_desc":"Provides disaster assistance and preparedness training, health services and first aid/CPR classes, and casework assistance to members of the military. Assists refugees with inquiries into whereabouts of family members in other countries","description":"DISASTER ASSISTANCE provided (home or apartment fire, earthquake, flood, public transportation accident or explosion) to families and the community. May provide food, clothing, shelter, health services and medical supplies to disaster victims. Provides disaster welfare inquiry service for large-scale disasters. To report a disaster, call 866-272-2237. To follow-up on a previously reported disaster, call 510-595-4441. All disaster assistance is free.HEALTH SERVICES include senior outreach and emergency aid stations. CLASSES offered in disaster training, planning and preparedness, first aid, cardiopulmonary resuscitation (CPR), cardiac defibrillation, and parent, infant and child first aid. In addition to being offered at the main Oakland site, classes are also offered at the Livermore Training Center, 373 North L Street, Livermore, and the Union City Training Center, 33641 Mission Blvd, Union City. REFUGEE inquiries regarding the whereabouts of family members in other countries are handled in cooperation with other Red Cross Societies.MILITARY ASSISTANCE: casework and assistance provided to members of the military and their families. Offers counseling, assistance with government benefits, temporary emergency financial assistance and referrals to community and military resources. For Armed Forces Emergency Services, including emergency communications, call 800-660-4272, 24 hours a day, 7 days a week.YOUTH SERVICES sends Youth Teams into schools where they teach youth about disaster preparedness at home and in school. Also sponsors youth leadership camp."}