{"_id":"d4ee4f25-a582-4b21-94c1-168e53e7fd82","_type":"location","sw_id":"PG004502_2_1_0","address_id":"8a8895f6-017f-4a46-9452-112b5c056d33","organization_id":"eff8c2dc-0e0e-4ae9-9763-51ec6820bfd6","short_desc":"Provides health insurance for Californians unable to obtain coverage in the individual health insurance market","description":"Provides health insurance for Californians unable to obtain coverage in the individual health insurance market Californians qualifying for the program participate in the cost of their coverage by paying premiums. The State of California supplements those premiums to cover the cost of care in the MRMIP. Application and Handbook available online and by phone.ELIGIBILITY REQUIREMENTS: Must be a California resident; cannot be eligible for Medicare Part A and B unless solely because of end-stage renal disease; cannot be eligible to purchase any health insurance for continuation of benefits under COBRA or Cal-COBRA; and has been unable to secure adequate coverage within the previous 12 months. View website for more details.DOCUMENTS REQUIRED: Supporting documentation indicating eligibility for MRMIP (on page 4 of downloadable handbook); copy of denial for individual insurance within the previous 12 months, or copy of letter indicating involuntary termination of health insurance within the previous 12 months for reasons other than nonpayment of premium or fraud, or copy of letter indicating individual health insurance premium in excess of MRMIP subscriber contribution amount; if eligible for Medicare Parts A and B, copy of Medicare letter explaining eligibility solely because of end-stage renal disease; if applying for deferred enrollment, copy of letter indicating when coverage ends; a check for one month's contribution for subscriber and/or dependent for chosen health plan; and (if applicable) Proof of Qualifying Prior Coverage to waive all or part of Exclusion/Waiting Period must be received prior to or with first month's contribution for credit to be given."}