{"_id":"662699fc-29bc-4e3c-aa2b-08120c9e266d","_type":"location","sw_id":"PG001987_2_1_0","address_id":"d13caf9a-bf7e-4910-881a-84f3d6c1b583","organization_id":"ec540093-0376-4f63-911c-cc08f25408fd","short_desc":"Provides on site counseling and emotional support to seniors able to come to the north Oakland office","description":"Provides ongoing supportive counseling to adults 55 years of age or older who are able to be seen in the agency's North Oakland office. Individual, couples and family counseling are provided by mental health interns who receive training in geriatric mental health and are supervised by licensed professionals. Provides trauma-informed care which considers the potential difficulties facing individuals who have survived a trauma, and is sensitive to avoid re-traumatization. Issues dealt with include depression, anxiety, isolation, trauma, loss, poverty, grief, declining health, marital and/or family discord.OLDER ADULT SUPPORT GROUPS for adults 55 years of age or older provide a safe, confidential place for people to receive and offer support and develop coping strategies regarding the challenges they face. Three ongoing support groups meet in the agency's North Oakland office. The size of the group is limited, and pre-registration is required.Grief Group meets Fridays at noon and provides education, support, and practical strategies to help older adults move toward healing in their grief experience.Women in Transition Support Group meets Mondays at 6pm. The second half of life can be filled with changes. Enables participants to meet with other women navigating these changes and learning to live up to their full potential.Support Group for Men and Women meets Tuesdays at 3:45pm. Explores the meaning of change, such as in retirement, career, relationships, health, outlook, and so forth.On occasion, support groups for adults 55 years of age or older are also offered at senior centers, senior residential facilities and churches. Call to inquire about on-site and community-based groups."}