{"_id":"45ff47b7-58fe-42d4-a075-2f1a3da15637","_type":"location","sw_id":"PG004024_2_1_0","address_id":"4df1c5a6-5df1-46d1-bd0f-afd093a7d81f","organization_id":"027b0677-5af4-45ff-a320-5272b5dbb114","short_desc":"BART tickets and discount tickets are available for purchase online, by mail, and at selected retail vendors. Regular fare BART tickets also available at station vending machines","description":"All BART stations have ticket vending machines that accept cash in denominations from nickels (5 cents) through $20 bills. BART tickets work like debit cards with stored value. Select machines also take credit and debit cards. To find the cost of a BART trip, use the BART Fare Calculator online.DISCOUNT TICKETS: BART discount tickets are sold online, by mail, or at selected Bay Area retail vendors. Not available at station vending machines. (CLIPPER CARDS / SMART CARDS: see separate Agency Record). Discount BART tickets include:BART Blue High Value Ticket: A 6.25% discount in two denominations: a $48 ticket for $45; a $64 for $60.BART Green Ticket: A 62.5% discount for seniors age 65 and older. A $24 ticket is available for $9. BART Green Ticket riders are required to carry proof of age.BART Red Ticket: A 62.5% discount for persons with disabilities, Medicare cardholders and children age 5-12 years. $24 ticket for $9. Adult Red Ticket riders are required to carry an RTC Discount ID Card, Medicare Card, DMV Disabled Parking Placard or license plate, or discount card from another California transit operator, and picture ID.BART Orange Ticket: A discount for middle and secondary school students. Special purchasing restrictions apply.BART Plus Ticket: A \"flash pass\" for other transit operators.REGIONAL TRANSIT CONNECTION (RTC) CARD: Entitles qualified persons with disabilities and senior citizens to a reduced fare on BART and other Bay Area transit systems. Inquire at Lake Merritt Station, 800 Madison Street, Oakland, 510-464-6000, TDD, 510-839-2218, Monday-Friday, 9-11:30am, 2-4pm. Call for eligibility requirements, certification criteria and documentation."}