{"_id":"42a1ffe5-109e-4f70-92ce-ff62ccda9ee6","_type":"location","sw_id":"PG000925_2_1_0","name":"Ariel Outreach Mission","address_id":"57c935c0-3de3-4795-8bc5-460aacf07312","organization_id":"172d16a1-62e5-4553-802e-94297bad3999","short_desc":"Provides temporary housing to clean and sober females without or with children age 3 and over. Free only on Friday, Saturday and Sunday. Following this, payment or collateral required. Must call first; no drop-ins","description":"Provides temporary housing to clean and sober females with or without small children (small enough to sleep with mother).Does not house men at site for any reason. Upon calling, men can be referred and  placed with housing. Also operates home for domestic violence and parolees individuals with mental health issues; must have payee.All callers must meet criteria and pass assessment for consideration for entry to shelter or for assistance.WEEKDAY AND WEEKEND POLICIES:Tuesday through Friday: Women must be willing to pay for Shared Emergency Transitional Housing. If no income source, women will be referred to other shelters that they will have to call until there is an opening, or place their name on waiting list. Emergency Transitional Housing available up to 21 days for $375, for single women (see FEES for more information). Single women with children on a case by case basis.Friday, Saturday, and Sunday: Shelter services are free (no charge). Free Shelter is ONLY open for weekends Friday, Saturday and Sunday. Approved clients must be at shelter site by or before 9am (shelter program will make allowances up to 10am on case-by-case basis). Client must exit out on Monday by or before 10am. To stay longer, must be able to pay on first day of additional time through date of extension. Will do same day shelter service to other sites if those sites have availability.INTAKE PHONE HOURS:Monday-Friday: 9:30-5. Takes calls after hours ONLY if client needs same-night intake for same-night shelter.Saturday: After 10:30am.Sunday: 6:30am-9am; stops doing intakes at 9am. Afterward, and only until 10am, takes 2-1-1 referrals ONLY on case-by-case, URGENT basis (i.e., client has absolutely no family, friends, resources).FAMILIES WITH MOTHER AND FATHER:Couples with or without children must have a marriage certificate, but must be willing to separate if program cannot find a place for the whole family (men can be sent to Bay Area Rescue Mission by or before 5pm; first come, first served. Women and children, if they meet criteria, may be able to stay in Ariel program, or can call Bay Area Rescue Mission, 510-215-4860 to see if they have availability).CLIENT REFERRALS GIVEN:All men with no finances are referred to Bay Area Rescue Mission by or before 5pm.Shelter only clients (not Transitional) will be given referrals.Single women and men in need of shelter after 9pm may be referred to St. Vincent de Paul in San Francisco on the corner of 5th and Bryant. It is a 24-h"}