{"_id":"60e7e567-9206-4b04-a80d-04b2d833f184","_type":"location","sw_id":"PG002141_2_1_0","address_id":"64aa830e-2809-4beb-9e4f-e904a02b132e","organization_id":"a54e628c-5d5f-4bef-a20e-e12507ce94cd","short_desc":"Provides library service and literacy/life skills instruction to men and women in Alameda County Jail System. Offers pre-release literacy and self-sufficiency training academy","description":"Alameda County Library Jails Services:The Alameda County Library provides library service and one-to-one volunteer literacy tutors to the more than 4,000 men and women held in the two County jails in Dublin and Oakland.Library Service: Over 75% of the materials circulated each year are donated by members of the community. Bestsellers, westerns, poetry, African-American fiction and non-fiction as well as books focused on self-help and recovery are all very popular.They bring in paperbacks only; no hardbacks are allowed.  If you have paperbacks or recent issues of popular magazines in good condition that you would like to donate please phone 510-745-1485.Literacy Tutoring: Volunteer literacy tutors are provided to inmates who read and write below the 8th grade level. They are not looking for any particular educational background in prospective volunteers, but it is important that they be flexible, patient, caring individuals who believe they have as much to learn as to teach. They also ask that prospective volunteers not seek to promote any political or religious platform within the jail. They ask that those interested in becoming volunteer jail tutors participate in a screening interview to qualify.The Alameda County Sheriff’s Department will conduct a security review for all volunteers working in the jails. Volunteers will also be required to attend a security orientation at the Alameda County Jail – dates TBA. Prospective volunteers should call (510) 745-1490.Start with a Story Program: “Start With a Story” delivers story times, free books, and family literacy activities to children, ages 1-16 years old, who visit at the Santa Rita Jail in Dublin, and at the Glenn Dyer Jail in downtown Oakland. Prospective volunteers can contact 510-745-1486 for more information."}