{"_id":"28c70c10-9341-49f9-badc-f9ea6ce1ed24","_type":"location","sw_id":"PG000465_2_1_0","address_id":"8c86f5eb-79bc-4782-971b-f09d8e04d4ed","organization_id":"7a268da7-671b-4379-8436-3e1975c38caf","short_desc":"Regional park system offers hiking trails, picnic and camping areas, and recreational activities","description":"Offers reservable picnic areas, opportunities for hiking, fishing, and boating, and three sites for overnight family drive-in camping. Offers barrier-free and wheelchair-accessible trails, picnic areas, beaches, playgrounds, pier, and pool. Beach wheelchairs are offered at five sites for wheelchair users. Provides low-cost park transportation for low-income schools and for groups serving children from low-income families, seniors, or people with disabilities.The following DISTRICT PARKS, listed by city, are located in Alameda County:Alameda: Crown Memorial State Beach.Berkeley: Eastshore State Park, Tilden Regional Park, including Regional Parks Botanic Garden and Tilden Nature Area.Castro Valley: Anthony Chabot Regional Park, Cull Canyon Regional Recreation Area, Lake Chabot Regional Park.Dublin: Dublin Hills.Fremont: Ardenwood Historic Farm, Quarry Lakes Regional Recreation Area, Coyote Hills Regional Park, Mission Peak Regional Preserve, and Vargas Plateau Regional Park (Fremont hills).Hayward: Don Castro Regional Recreation Area, Five Canyons Open Space, Garin/Dry Creek Pioneer Regional Parks, and Hayward Regional Shorelin.Livermore: Del Valle Regional Park, Morgan Territory Regional Preserve, and Brushy Peak Regional Preserve.Oakland: Huckleberry Botanic Regional Preserve, Claremont Canyon Regional Preserve, Leona Canyon Regional Open Space Preserve, Martin Luther King Jr. Regional Shoreline, Redwood Regional Park, Roberts Regional Recreation Area, Sibley Volcanic Regional Preserve, and Temescal Regional Recreation Area.Pleasanton: Pleasanton Ridge Regional Park, Shadow Cliffs Regional Recreation Area.San Leandro: Oyster Bay Regional Shoreline.Sunol: Sunol Regional Wilderness.Southern Alameda County: Ohlone Regional Wilderness accessible only to hikers and equestrians through the Ohlone Wilderness Trail."}