{"_id":"f059c44b-6a63-45cb-92bc-36ecbe26ee1f","_type":"location","sw_id":"PG002401_2_1_0","address_id":"0dcd7bbb-8700-46d7-8794-3dc26ee2bc73","organization_id":"5bc55673-4c83-494f-af4b-59345053c498","short_desc":"Owns and operates low-income affordable apartment complexes in Alameda and Contra Costa Counties, but primarily in Oakland","description":"Visit web site for list of properties accepting applications and to download application.EBALDC owns and operates 19 low-income affordable apartment complexes in Alameda and Contra Costa Counties, but primarily in Oakland. Multi-family properties include California Hotel (with Project-based Section 8 Vouchers “PBS8”), Drasnin Manor (PBS8), Frank G Mar Apartments, Hismen Hin-Nu Terrace, Marcus Garvey Commons, Madison Park Apartments (PBS8), Effie’s House (PBS8), Giant Road Apartments (PBS8 in City of San Pablo), Hugh Taylor House (PBS8), Lillie Mae Jones Plaza (PBS8 in City of Richmond), Oakland Point LP (PBS8), Oak Park Apartments, Seven Directions Apartments (PBS8), Slim Jenkins Court (PBS8) and Swan’s Market Apartments. Senior properties include Jack London Gateway Senior Housing (PBS8, 55+), Avalon Senior Housing (in City of Emeryville, 62+), San Pablo Hotel (SRO, 55+), SRO properties include Madrone Hotel. Related Companies manages Noble Tower (Senior Housing) and Lion Creek Crossings (Phase I-IV, Multi-family).On-site resident services are offered at California Hotel, Madison Park Apartments, Giant Road Apartments, Jack London Gateway Senior Housing, Oakland Point LP, San Pablo Hotel, Hismen Hin-Nu Terrace, Lillie Mae Jones Plaza, Noble Tower and Lion Creek Crossings. Limited resident services are offered at Hugh Taylor House, Oak Park Apartments, Seven Directions Apartments and Drasnin Manor. Services vary by site and could be including counseling, referrals, classes (ESL, computer, financial literacy), translation services, senior support services, and children’s events.ADA-accessible and/or adaptable housing units offered at all properties except Madrone Hotel. HOPWA units are available at Swans Market Apartments (4), Lillie Mae Jones Plaza (5) and California Hotel (5); MHSA units are available at Lillie Mae Jones (8). Units targeted for special needs are available at California Hotel (35). Most sites follow EveryOne Home screening standards."}