{"_id":"b73373cd-730b-4f80-b97a-cae067127e97","_type":"location","sw_id":"PG004663_2_1_0","address_id":"142419f5-2b1d-468b-b9a5-352241cee533","organization_id":"6f4ff1c7-1022-4489-b64c-f8fe71275aba","short_desc":"Coordinates recovery assistance efforts when disaster impacts individuals and households, businesses and agricultural communities in California","description":"Responds to and aids in the recovery from emergencies within the State of California. Manages disaster recovery and provides assistance to local governments and individuals impacted by disasters.INDIVIDUAL ASSISTANCE BRANCH provides recovery assistance following a disaster that impacts individuals and households, businesses, and/or the agricultural community. Coordinates recovery assistance with federal, state, local, and voluntary/nonprofit entities. The Individual Assistance recovery process involves the following:EMERGENCY ASSISTANCE through voluntary agencies, such as the American Red Cross or Salvation Army, can include emergency housing in the form of shelters or hotel vouchers, food, or clothing during any significant emergency. Contact local voluntary agency. INSURANCE: Individuals should contact their insurance company to report their loss. Ask insurance agent or representative to help with the claim. For assistance with insurance issues, contact the California Department of Insurance at 1-800-927-HELP (4357) or by visiting their website. FEDERAL ASSISTANCE PROGRAMS: Governor may determine recovery is beyond the resources of state and local governments and can request federal assistance by seeking a Presidential Declaration. Declaration initiates Federal Emergency Management Agency (FEMA) assistance process through its Individuals and Household Program (IHP). This includes \"Housing Needs\"  (temporary housing, repair, replacement, construction) and \"Other than Housing Needs\" (see website for inclusions).STATE SUPPLEMENTAL GRANT PROGRAM (SSGP): Administered by the California Department of Social Services (CDSS), provides grant funds to assist people who have suffered damage in a disaster area declared by the President, and when FEMA's IHP is implemented. There is no separate application process, as FEMA will refer applications to CDSS when the maximum assistance from FEMA's IHP has been reached. As with the FEMA IHP, SSGP cannot duplicate assistance from any governmental agency or personal insurance.UNMET NEEDS: Once a disaster survivor has exhausted all other assistance programs, voluntary agencies may implement programs to assist people with necessary remaining unmet needs. Local Long Term Recovery Committees may be formed within a disaster area to coordinate resources for recovery. Additionally, Voluntary Organizations Active in Disasters (VOADS) may be able to assist individuals and families with their recovery efforts. Contact regional VO"}