{"_id":"c04dbd3f-236d-4404-8c4c-b08059c3a1cd","_type":"location","sw_id":"PG000486_2_1_0","address_id":"1a0914e9-6885-4e70-9825-9e0d6848c502","organization_id":"ec540093-0376-4f63-911c-cc08f25408fd","short_desc":"Emotional support for people who have experienced the sudden death of a loved one","description":"The Grief Counseling Project provides short-term individual, couples, group, and family counseling for the bereaved, particularly for those who are grieving sudden, traumatic deaths. Counseling is provided by mental health interns who receive specialized training and are supervised by licensed professionals.Bereavement Support Group offers safe, confidential support around loss, coping and life transitions. Provides education, support, and practical strategies to help individuals move toward healing in their personal grief experience.Survivor of Suicide Support Group provides a safe, confidential place for people to receive support and develop coping strategies regarding the challenging grief work associated with death by suicide. Often, sharing one’s feelings and experience of loss with others, understanding one's emotions, and learning about loss specific to suicide can greatly aid in the healing process.Homicide Survivors Support Group provides support, coping strategies and a safe outlet for people who have lost a friend or relative to homicide. Death by homicide can be especially difficult for survivors who are often re-traumatized by the criminal justice system and may feel stuck in the experience of helplessness, intense sadness and rage.Suicide Attempters’ Group provides support for individuals who have made a previous suicide attempt. These individuals are 16 times more likely to die by suicide than the general population. Offers depressed and suicidal adults a safe, confidential and supportive environment in which to explore his or her own unique experiences. Focuses on difficulties in interpersonal relationships and communication problems which are characteristic of many suicidal individuals."}