{"_id":"0cf31879-8748-4153-bf3f-263a1b48ef92","_type":"location","sw_id":"PG003247_2_1_0","address_id":"bcfb3b75-586f-4f7a-8794-3d6005038a62","organization_id":"826878d6-355a-48ff-b497-bf73b0a77751","short_desc":"Provides prevention, intervention and support services to girls ages 11-18 years old. All of the girls that MISSSEY’s serves are either at high risk for or are victims or survivors of commercial sexual exploitation","description":"MISSSEY’s direct services provide prevention, intervention and support services to girls ages 11-18 years old. All of the girls that MISSSEY’s serves are either at high risk for or are victims or survivors of commercial sexual exploitation. Many of the girls come from generational poverty and generational abuse, especially sexual abuse. The girls have been deeply impacted by a continuum of trauma throughout their lives and are in great need of unconditional love and long-term support. MISSSEY offers a peer and survivor informed and lead direct service model to respond to the specialized needs of this population. Their services include a drop-in center, case management, youth advocacy and mentorship. Several members of the direct service staff are survivors and graduates of the MISSSEY program enabling them to offer a unique perspective to both their clients and the work overall. The drop-in center facilitates daily workshop and activities on topics such as education, career choices, gender roles, self-care, empowerment, healthy relationships and community service as well teaches valuable life skills. Case management provides intensive support including working with girl’s caregivers, accompanying girls to court, attending meetings with girls school, social workers and probation officers, helping girls access medical and mental health services. Youth advocacy goes into group homes and other foster care setting to educate girls about this issue. Mentorship matches girls one-on-one with caring adults who will spend a couple of hours with them weekly supporting their goals and dreams."}