{"_id":"e4566c83-6026-422a-aa16-03c6f79044aa","_type":"location","sw_id":"PG003488_2_1_0","name":"Division of Environmental Health - General Environmental Health Programs","address_id":"66b6c67b-2038-4fba-9098-29973a6913f2","organization_id":"38f231c2-f6e5-4dbf-86bb-4bde7244196d","short_desc":"Environmental Health Programs:Retail Food Facility Permit and Inspection Program - Inspect all retail food facilities such as restaurants and markets to ensure compliance with sanitation and hygiene laws.Community Noise Program - Mandated by the Berkele.....more","description":"Environmental Health Programs:Retail Food Facility Permit and Inspection Program - Inspect all retail food facilities such as restaurants and markets to ensure compliance with sanitation and hygiene laws.Community Noise Program - Mandated by the Berkeley Municipal Code (BMC) and sets forth standards by which noise is measured. Public Pool Program - Inspections of Berkeley's public pools to ensure adherence with appropriate health and safety standardsSmoking Pollution Program - Mandated by State law and the Berkeley Municipal Code (BMC). Stormwater Inspection Program - Mandated by State requirements, the City of Berkeley, along with the County of Alameda are required to implement a stormwater compliance program.Waste Tire Enforcement Program - By working with businesses, property owners and other agencies, the City hopes to reduce illegal dumping of waste tires, and improve the quality of life in Berkeley. Community Outreach - Health inspectors in the Division of Environmental Health are active in community outreach such as staffing informational booths for outreach.Emergency Response - Staff respond to emergencies related to food facilities, such as the outbreak of foodborne illnesses, sewage overflows, water line breaks and electrical power outages.Tattooing, Body Piercing and Permanent Cosmetics - The law states that \"No person shall perform tattooing, application of permanent cosmetics or body piercing unless such a person is registered with the LEA to perform tattooing, permanent cosmetics, or body piercing.\""}